#include "Ве_крест_крест.h"

ⰲⱀⰵⰴⱃⰻⱅⱐ ⱈⱆⱅⱁⱃ Ⱃⱆⱄⱐ;

ⱄⰲⰵⱅ_ⰿⱁⰺ_ⰸⰵⱃⰽⰰⰾⱐⱌⰵ <ⱄⰽⰰⰶⰻ Т>
ⰱⰵⱄⱅⱁⰾⱁⱍⱐ ⱂⱆⰸⱏⰺⱃⱐ(Т* ⱂⱁⰾⰽ, ⱌⰵⰾⰻⱀⰰ ⱂⱁⰳⱁⰾⱁⰲⱐⰵ)
{
	ⰴⰾⱔ(ⰿⰵⱃⰻⰾⱁ ⰾⱁⰽⱁⱅⱐ = 0; ⰾⱁⰽⱁⱅⱐ < ⱂⱁⰳⱁⰾⱁⰲⱐⰵ; ++ⰾⱁⰽⱁⱅⱐ)
		ⰴⰾⱔ(ⰿⰵⱃⰻⰾⱁ ⰰⱃⱎⰻⱀ = ⰾⱁⰽⱁⱅⱐ; ⰰⱃⱎⰻⱀ < ⱂⱁⰳⱁⰾⱁⰲⱐⰵ; ++ⰰⱃⱎⰻⱀ)
			ⰽⱁⰾⰻ(ⱂⱁⰾⰽ[ⰾⱁⰽⱁⱅⱐ] > ⱂⱁⰾⰽ[ⰰⱃⱎⰻⱀ])
				ⰿⰵⱀⱔⰾⱁ(ⱂⱁⰾⰽ[ⰾⱁⰽⱁⱅⱐ], ⱂⱁⰾⰽ[ⰰⱃⱎⰻⱀ]);
}

ⱌⰰⱃⱐ_ⰻⰰⱅⱓⱎⰽⰰ_ⰳⰾⰰⰲⱀⱏⰺⰺ()
{
	ⰲⱂⰵⱃⱑⰴ_ⱄⰾⰰⰲⱔⱀⰵ;
	ⰿⱁⰾⰲⰻⱅⱐ << "Ⱀⰰⱍⰰⰾⱁ ⱃⰰⰱⱁⱅⱏⰺ" << прыг_скок;
	ⱌⰵⰾⰻⱀⰰ ⱃⰰⰸⰿⰵⱃ = 100000;
	// ⱌⰰⱃⱐ ⰲⱏⰺⰴⰵⰾⰻⰾ ⰿⰵⱄⱅⱁ ⰴⰾⱔ ⰸⰰⱄⰵⰾⰵⱀⰻⱔ
	ⱌⰵⰾⰻⱀⰰ* ⰴⰵⱃⰵⰲⱀⱔ = новь ⱌⰵⰾⰻⱀⰰ[ⱃⰰⰸⰿⰵⱃ]; 
	// ⰴⰵⱃⰵⰲⱀⱔ ⰸⰰⱄⰵⰾⰻⰾⰻⱄⱐ
	ⰴⰾⱔ(ⱌⰵⰾⰻⱀⰰ ⱂⱆⰴ = ⱃⰰⰸⰿⰵⱃ - 1; ⱂⱆⰴ >= 0; --ⱂⱆⰴ)
 		ⰴⰵⱃⰵⰲⱀⱔ[ⱂⱆⰴ] = ⱂⱆⰴ + 1;
	// в ⰴⱃⰵⰲⱀⰵ ⱆⱄⱅⰰⱀⱁⰲⰾⰵⱀ ⱂⱁⱃⱔⰴⱁⰽ
	пузырь(ⰴⰵⱃⰵⰲⱀⱔ, ⱃⰰⰸⰿⰵⱃ);
	ⰿⱁⰾⰲⰻⱅⱐ << "Ⱃⱆⱄⱁⰲ ⱀⰵ ⱁⱂⰵⱃⰵⰴⰿⱅⰵ, ⰸⰿⰵⰻ ⱁⰽⱁⱔⱀⱀⱏⰺⰵ";
	// ⱈⱁⰾⱁⱂⱏⰺ ⰲⱏⰺⱄⰵⰾⰵⱀⱏⰺ ⰸⰰ ⱄⱁⰴⰵⰺⱄⱅⰲⰻⰵ ⱃⰵⱂⱅⰻⰾⰻⱔⰿ
	ⰽⰰⰸⱀⱐ ⰴⰵⱃⰵⰲⱀⱔ;
	ⰲⱁⰸⰴⰰⱅⱐ ⱀⱁⰾⱐ;
}